#### HostObjectSubcomponentInfo Members

---

|  |
| --- |
| HostObjectSubcomponentInfo Class   Methods   Properties   See Also |

The  HostObjectSubcomponentInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  HostObjectSubcomponentInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCurveLoop | Gets the CurveLoop representing the base profile curve loop of the roof or floor slab |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPlane | Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AreaOfCurveLoop | The area of the CurveLoop of the roof or floor slab. |
| Public property | Depth | The depth of the roof or floor slab. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LoopFace | The face of the loops of the roof or floor slab. |

# See Also

HostObjectSubcomponentInfo Class

Autodesk.Revit.DB.IFC Namespace